<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"azurerm","backend":"96593e1fd2c1dc13918cae5b7eb8758f4f0276733c075762d06f24f9cbba99b6","plan_job_ref":"Job Create terraform plan #66 at https://github.com/Zeichen-gegen-Mobbing/Projectcoordinator/actions/runs/17120075920","plan_out_hash":"d31bb83b5a3cc866ca7f969566b92039275df7dddea5b9689c64c7e51fc3e062","plan_hash":"1e824ec29f5b68b895002abf7b5286f9f70a7a595c8d0a38ba12a7d7a7c2a4ca","plan_text_format":"diff","version":"2.2.2"} -->
OpenTofu plan in __infrastructure__
With backend config: `resource_group_name=rg-ProjectCoordinator-Deploy-prd
storage_account_name=stprdtfprojectcoordinato
container_name=tfstate`<details open><summary>With variables</summary>

```hcl
environment                = "prd"
open_route_service_api_key = (sensitive value)
```
</details>
<details>
<summary>Plan: 3 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
OpenTofu used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

OpenTofu will perform the following actions:

  # azuread_application.client will be created
+   resource "azuread_application" "client" {
+       app_role_ids                = (known after apply)
+       client_id                   = (known after apply)
+       description                 = "Application to login to the Projectcoordinator application"
+       disabled_by_microsoft       = (known after apply)
+       display_name                = "Projectcoordinator-prd"
+       id                          = (known after apply)
+       logo_url                    = (known after apply)
+       oauth2_permission_scope_ids = (known after apply)
+       object_id                   = (known after apply)
+       owners                      = [
+           "b7269a0e-d286-4aa1-94f9-1ff7eb2abfd3",
        ]
+       prevent_duplicate_names     = true
+       publisher_domain            = (known after apply)
+       sign_in_audience            = "AzureADMyOrg"
+       tags                        = (known after apply)
+       template_id                 = (known after apply)

+       feature_tags (known after apply)

+       password (known after apply)

+       required_resource_access {
+           resource_app_id = "************************************"

+           resource_access {
+               id   = (known after apply)
+               type = "Scope"
            }
        }

+       single_page_application {
+           redirect_uris = (known after apply)
        }
    }

  # azuread_service_principal.microsoft_graph will be created
+   resource "azuread_service_principal" "microsoft_graph" {
+       account_enabled             = true
+       app_role_ids                = (known after apply)
+       app_roles                   = (known after apply)
+       application_tenant_id       = (known after apply)
+       client_id                   = "************************************"
+       display_name                = (known after apply)
+       homepage_url                = (known after apply)
+       id                          = (known after apply)
+       logout_url                  = (known after apply)
+       oauth2_permission_scope_ids = (known after apply)
+       oauth2_permission_scopes    = (known after apply)
+       object_id                   = (known after apply)
+       redirect_uris               = (known after apply)
+       saml_metadata_url           = (known after apply)
+       service_principal_names     = (known after apply)
+       sign_in_audience            = (known after apply)
+       tags                        = (known after apply)
+       type                        = (known after apply)
+       use_existing                = true

+       feature_tags (known after apply)

+       features (known after apply)
    }

  # azurerm_static_web_app.this will be created
+   resource "azurerm_static_web_app" "this" {
+       api_key                            = (sensitive value)
+       app_settings                       = {
+           "Cosmos__ConnectionString" = "AccountEndpoint=https://localhost:8081/;AccountKey=C2y6yDjf5/R+ob0N8A7Cgv30VRDJIWEHLM+4QDU5DE2nQ9nDuVTqobD4b8mGGyPMbIZnqyMsEcaGQy67XIw/Jw=="
+           "OpenRouteService__ApiKey" = (sensitive value)
        }
+       configuration_file_changes_enabled = true
+       default_host_name                  = (known after apply)
+       id                                 = (known after apply)
+       location                           = "westeurope"
+       name                               = "stapp-ProjectCoordinator-prd"
+       preview_environments_enabled       = true
+       public_network_access_enabled      = true
+       resource_group_name                = "rg-ProjectCoordinator-prd"
+       sku_size                           = "Free"
+       sku_tier                           = "Free"
    }

Plan: 3 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   static_web_app_api_key = (sensitive value)
```
</details>

:memo: Plan generated in [Create terraform plan #66](https://github.com/Zeichen-gegen-Mobbing/Projectcoordinator/actions/runs/17120075920)